src/org/the-emacs-note.org
#+TITLE: Emacs 使用笔记
#+DATE: [2019-04-20 Sat 09:32]
#+AUTHOR: Siqing Mu


**** 常用操作命令

 - C-g 停止当前运行/输入的命令
 - C-x u 撤销
 - M-x revert-buffer RETURN 撤销上次存盘后的所有改动
 - M-x recover-file RETURN 从自动存盘文件恢复
 - M-x recover-session RETURN 如果你编辑了几个文件, 用这个恢复
 - C-u C-c ! 插入日期时间

多行注释： 
1. 选中一段区域到最后一行行首（！很重要！）；
2. 按 C-x r t ；
3. 输入注释内容；

反多行注释： 
1. 选中一段区域到最后一行，紧挨着注释字符之后的位置（！很重要！）；
2. 按 c-x r k；
   

Emacs默认的标记的快捷键是ctrl+空格和ctrl+@。前者和中文系统的输入法切换有冲突，后者其实是ctrl+shift+2，极度难按。所以如果经常按请重新设置键位。
按完之后就进入了标记状态，然后以任意方式移动光标，标记起始位和光标之间的内容都会被选中，然后根据情况你就能复制或者剪切。如果要多行，那么先ctrl-a到开头，然后ctrl+shift+2标记，ctrl+n移动数行，ctrl+e到行尾。然后该剪切剪切（ctrl+w），该复制复制（alt+w）。

